Importing libraries

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pp
import seaborn

In [2]:
matplotlib inline

extracting zip files

In [3]:
import zipfile
zipfile.ZipFile('names.zip').extractall('.')

Accessing file content

In [15]:
open('yob2010.txt','r').readlines()[0:5]

['Isabella,F,22925\n',
 'Sophia,F,20648\n',
 'Emma,F,17354\n',
 'Olivia,F,17030\n',
 'Ava,F,15436\n']

In [22]:
column_names=['Name','Sex','Babies']
df=pd.read_csv('yob2010.txt',names=column_names)

In [23]:
df.head()

       Name Sex  Babies
0  Isabella   F   22925
1    Sophia   F   20648
2      Emma   F   17354
3    Olivia   F   17030
4       Ava   F   15436

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34089 entries, 0 to 34088
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    34089 non-null  object
 1   Sex     34089 non-null  object
 2   Babies  34089 non-null  int64
dtypes: int64(1), object(2)
memory usage: 799.1+ KB

In [79]:
twoyears = []
print(twoyears)

twoyears.append(pd.read_csv('yob2014.txt'.format(year),names = ['Name', 'Sex', 'Babies']))
print(pd.concat(twoyears))

twoyears.append(pd.read_csv('yob2015.txt'.format(year),names = ['Name', 'Sex', 'Babies']))
print(pd.concat(twoyears))

[]
           Name Sex  Babies
0          Emma   F   20949
1        Olivia   F   19826
2        Sophia   F   18633
3      Isabella   F   17115
4           Ava   F   15715
...         ...  ..     ...
33275    Zykeem   M       5
33276    Zymeer   M       5
33277   Zymiere   M       5
33278     Zyran   M       5
33279     Zyrin   M       5

[33280 rows x 3 columns]
           Name Sex  Babies
0          Emma   F   20949
1        Olivia   F   19826
2        Sophia   F   18633
3      Isabella   F   17115
4           Ava   F   15715
...         ...  ..     ...
33151    Zykell   M       5
33152    Zyking   M       5
33153     Zykir   M       5
33154     Zyrus   M       5
33155      Zyus   M       5

[66436 rows x 3 columns]

In [72]:
all_years = []

for year in range(1880, 2015+1):
    all_years.append(pd.read_csv('yob{}.txt'.format(year),names = ['Name', 'Sex', 'Babies']))
    all_years[-1]['Year'] = year

all_names = pd.concat(all_years)
all_names['S.no'] = np.arange(len(all_names))

In [87]:
all_names.head()

        Name Sex  Babies  Year  S.no
0       Mary   F    7065  1880     0
1       Anna   F    2604  1880     1
2       Emma   F    2003  1880     2
3  Elizabeth   F    1939  1880     3
4     Minnie   F    1746  1880     4

In [82]:
groupSY=all_names.groupby(['Sex','Year'])

In [84]:
print(groupSY)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7eff96e1fee0>

In [85]:
groupSY.size()

Sex  Year
F    1880      942
     1881      938
     1882     1028
     1883     1054
     1884     1172
             ...
M    2011    14347
     2012    14244
     2013    14054
     2014    14063
     2015    14048
Length: 272, dtype: int64

In [89]:
groupSY.size().unstack()

Year,1880,1881,1882,1883,1884,1885,1886,1887,1888,1889,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
Sex,,,,,,,,,,,,,,,,,,,,,
F,942,938,1028,1054,1172,1197,1282,1306,1474,1479,...,20056,20572,20470,20190,19823,19576,19519,19259,19217,19108
M,1058,996,1099,1030,1125,1097,1110,1067,1177,1111,...,14041,14393,14618,14532,14266,14347,14244,14054,14063,14048

Loading csv data into pandas DataFrame